[
    {
      "title": "ENGR1330",
      "Course_Description": "Introduces Python programming, its relevant modules and libraries, and computational thinking for solving problems in Data Science. Students will learn data science approaches to importing, manipulating, and analyzing data as well as modeling and visualizing real-world data sets in various science and engineering discipline. This course provides a hands-on learning of principles of programming and data science by introducing Python programming, its relevant modules and libraries, and computational thinking for solving problems in data science. Students will learn data science approaches to importing data, manipulating data, and analyzing it as well as modeling and visualizing real-world data sets in various science and engineering.",
      "Course_Objectives": "Computational thinking for problem-solving: Logical problem solving, decomposition, pattern recognition, abstraction, representation, algorithm design, and generalization. Python Programming: Variables, constants, data types, data structures, strings, math operators, boolean operators, expressions, program constructs, functions, loops, I/O files, modules, and database. Data science fundamentals: Experimental setup, introductory statistical analysis with Python, basic data analysis, visualization, and machine learning.",
      "learning_outcomes": "On completion of the course, students should be able to implement basic Python programs using computational thinking concepts, know basic Python programming constructs and libraries relevant to data science, and write Python scripts to perform fundamental data analytics and basic visualization."
    },
    {
      "title": "POLS2306",
      "Course_Description": "This course will introduce you to the fundamentals of Texas government as well as exploring concepts within the topic of Political Science and Public Policy. At the completion of this course, students will be able to demonstrate knowledge of the origins and evolution of U.S. and Texas political systems. They will have a clear understanding of the organization and functions of the different levels of government in the United States, be able to explain the importance of the United States Constitution and those of the states, and be able to comment on the role of civic engagement in United States politics and culture.",
      "Course_Objectives": "Demonstrate knowledge of the origins and evolution of U.S. and Texas political systems, understand the organization and functions of different levels of government, explain the importance of the U.S. and state constitutions, and evaluate the role of civic engagement in politics and culture.",
      "learning_outcomes": "Explain the origin and development of the Texas Constitution; describe state and local political systems and their relationship with the federal government; analyze separation of powers and checks and balances in theory and practice; demonstrate knowledge of legislative, executive, and judicial branches of Texas government; evaluate the role of public opinion, interest groups, and political parties; analyze state and local election processes; identify citizens’ rights and responsibilities; assess issues, policies, and political culture of Texas; demonstrate the effects of U.S. and Texas Constitutions on public policy."
    }
  ]